AliTaima/-Embedded_System_Online_Diploma/Unit_8_MCU_Interfacing/Lesson3_UART_Driver_STM32/STM32F103C6_With_Polling/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#if !defined(__SOFT_FP__) && defined(__ARM_FP)
  #warning "FPU is not initialized, but the project is compiling for an FPU. Please initialize the FPU before use."
#endif

#include <stdint.h>
#include <stdlib.h>
#include <stdio.h>

#include "STM32F103x8.h"
#include "stm32f103x8_gpio_driver.h"
#include "lcd.h"
#include "keypad.h"
#include "stm32f103x8_EXTI_driver.h"
#include "stm32f103x8_USART_driver.h"


unsigned int IRQ_Flag = 0 ;
uint16_t ch ;


void UART_IRQ_Callback (struct  UART_IRQ_Event* flag)
{

	MCAL_UART_ReceiveData(USART1, &ch, disable);
	MCAL_UART_SendData(USART1, &ch, enable);

}

int main(void)
{

	//Enable CLock
		RCC_GPIOA_CLK_EN();
		RCC_GPIOB_CLK_EN();
		RCC_AFIO_CLK_EN();

		UART_Config uartCFG ;
		uartCFG.BaudRate = UART_BaudRate_115200 ;
		uartCFG.HwFlowCtl = UART_HwFlowCtl_NONE ;
		uartCFG.IRQ_Enable = UART_IRQ_Enable_NONE ;
		uartCFG.P_IRQ_CallBack = NULL ;
		uartCFG.Parity =UART_Parity__NONE ;
		uartCFG.Payload_Length = UART_Payload_Length_8B;
		uartCFG.StopBits = UART_StopBits__1 ;
		uartCFG.USART_Mode = UART_MODE_TX_RX ;

		MCAL_UART_Init(USART1, &uartCFG);
		MCAL_UART_GPIO_Set_Pins(USART1);

		/* Loop forever */
		while(1)
		{
			MCAL_UART_ReceiveData(USART1, &ch, enable);
			MCAL_UART_SendData(USART1, &ch, enable);
		}

}
